{"Flattened Column Headers":{"0":"Year","1":"Suppressed","2":"Milk Cows","3":"Production of milk and milkfat; Per milk cow; Milk","4":"Production of milk and milkfat; Per milk cow; Milkfat","5":"Production of milk and milkfat; All milk percent of fat","6":"Production of milk and milkfat; Total; Milk","7":"Production of milk and milkfat; Total; Milkfat","8":"Milk used where produced; Fed to calves","9":"Milk used where produced; Milk, cream, and butter","10":"Milk used where produced; Total","11":"Milk marketed by producers; Total","12":"Milk marketed by producers; Fluid grade","13":"Combined marketings of milk and cream; Milk utilized","14":"Combined marketings of milk and cream; All milk average returns per cwt","15":"Combined marketings of milk and cream; Returns per pound of milkfat","16":"Combined marketings of milk and cream; Cash receipts from marketings","17":"Combined marketings of milk and cream; Used for milk, cream, and butter by producers; Milk utilized","18":"Combined marketings of milk and cream; Used for milk cream, and butter by producers; Value","19":"Combined marketings of milk and cream; Gross producer income","20":"Combined marketings of milk and cream; Value of milk produced"},"Best Guess User Friendly Header":{"0":"Year","1":"Suppressed","2":"Milk Cows","3":"Milk Production per Milk Cow","4":"Milkfat Production per Milk Cow","5":"Fat Percentage of Milk","6":"Milk Production (Lbs)","7":"Milkfat Production (Lbs)","8":"Milk Fed to Calves","9":"Milk, Cream and Butter Used Where Produced","10":"Milk Used Where Produced","11":"Total Milk Marketed by Producers","12":"Fluid Grade Percentage of Milk Marketed by Producers","13":"Pending","14":"Pending","15":"Pending","16":"Pending","17":"Pending","18":"Pending","19":"Pending","20":"Pending"},"Description":{"0":"Calendar year of survey estimate","1":"Indicates if a NULL value in a column is NULL not because it is simply absent from the record, but because the value was suppressed for disclosure reasons. If no such column is in your data sample then none of your results included suppressed values.","2":"Heads of milk producing cows","3":"Pounds of milk produced per milk cow","4":"Pounds of milkfat produced per milk cow","5":"Percentage of milk that is fat","6":"Pounds of milk produced","7":"Pounds of milkfat produced","8":"Pounds of used, where produced, to feed calves.","9":"Pounds of milk, cream and butter used where produced","10":"Pending, It's confusing to have both of these columns in the report, is this column, technically, a subset of the previous column? (I.e. could we subtract its value from the former column to find the Pounds of cream and butter used where produced?)","11":"see footnote","12":"see footnote","13":"Pending. Is this some sub-set of \"Milk marketed by producers; Total?\"","14":"Pending. But presumably the average dollar returns per hundred pounds of milk that was marketed","15":"Pending. But, presumably, the average dollar returns per pound of milkfat that was marketed","16":"Pending. And seemingly complicated","17":"Pending, this is either a redundance with previous columns or it indicates a complicated interaction where milk can be broken down into water, fat, and \"dry milk\" and then marketed and recombined in various ways to produce milk or any of its \"distillates.\" Anyway, need some more domain expertise to figure this out","18":"Pending","19":"Pending","20":"Pending"},"Footnotes":{"0":"None","1":"None","2":"Average number during year, excluding heifers not yet fresh","3":"Excludes milk sucked by calves","4":"Excludes milk sucked by calves","5":"Excludes milk sucked by calves","6":"Excludes milk sucked by calves","7":"Excludes milk sucked by calves","8":"Excludes milk sucked by calves. *Need to clarify with NASS Statisticians, or somewhere, if this \"super footnote\" is indeed intended to apply to the sub-header under it.","9":"None","10":"None","11":"Milk sold to plants and dealers as whole milk and equivalent amounts of milk for cream. Includes milk produced by dealeer's own herds and milk sold directly to consumers. Also includes milk produced by institutional herds","12":"Percentage of milk sold that is eligible for fluid use (Grade A in most States.) Includes fluid grade milk used in manufacturing dairy products","13":"None","14":"Cash receipts divided by milk or milkfat in combined marketings.","15":"None","16":"None","17":"None","18":"Value at average returns per 100 pounds of milk in combined marketings of milk and cream","19":"Cash receipts from marketings of milk and cream plus value of milk used for home consumption","20":"Includes value of milk fed to calves"},"Units":{"0":"Calendar year","1":"Boolean","2":"Heads of cattle","3":"Lbs per cattle-head","4":"Lbs per cattle-head","5":"Percent","6":"Lbs","7":"Lbs","8":"Lbs","9":"Lbs","10":"Pending","11":"Lbs","12":"Percent","13":"Pending","14":"USD","15":"USD","16":"USD","17":"Lbs","18":"USD","19":"USD","20":"USD"},"Aggregation":{"0":null,"1":"None","2":"Pending","3":"Pending","4":"Pending","5":"Pending","6":"Pending","7":"Pending","8":"Pending","9":"Pending","10":"Pending","11":"Pending","12":"Pending","13":"Pending","14":"Average","15":"Pending","16":"Pending","17":"Pending","18":"Pending","19":"Pending","20":"Pending"},"Data Item":{"0":"Year","1":"None","2":"CATTLE, COWS, MILK - INVENTORY, AVG, MEASURED IN HEAD","3":"Pending","4":"Pending","5":"Pending","6":"Pending","7":"Pending","8":"Pending","9":"Pending","10":"Pending","11":"Pending","12":"Pending","13":"Pending","14":"Pending","15":"Pending","16":"Pending","17":"Pending","18":"Pending","19":"Pending","20":"Pending"},"Commodity":{"0":null,"1":"Pending","2":"CATTLE","3":"Pending","4":"Pending","5":"Pending","6":"Pending","7":"Pending","8":"Pending","9":"Pending","10":"Pending","11":"Pending","12":"Pending","13":"Pending","14":"Pending","15":"Pending","16":"Pending","17":"Pending","18":"Pending","19":"Pending","20":"Pending"}}